//--------------------------------------------------------------------------------------------------

var Onloader = $.extend(
    
/*--------------------------------------------------------------------------------------------------
|
| -> Добавляет новый обработчик
|
|-------------------------------------------------------------------------------------------------*/

    {public: {on: function(callback, priority) {
    // Приоритет по умолчанию
        priority = priority||0;
        
    // Создаем список приоритетов
        if (!this.priority) {
            this.priority = [];
            this.list = {};
        }
        
    // Создаем новый приоритет
        if (!this.list[priority]) {
            this.list[priority] = [];
            this.priority[this.priority.length] = priority;
        }
        
    // Добавляем обработчик
        this.list[priority][this.list[priority].length] = callback;
    }}},
    
/*--------------------------------------------------------------------------------------------------
|
| -> Выполняет все добавленные обработчики
|
|-------------------------------------------------------------------------------------------------*/

    {public: {onload: function() {
    // Проверяем наличие приоритетов
        if (this.priority) {
        // Сортируем приоритеты
            this.priority.sort(function(a, b) {
                return a - b;
            });
            
        // Проходим по списку приоритетов
            for (var i = 0; i < this.priority.length; i++) {
            // Проходим по списку обработчиков текущего приоритета
                for (var j = 0; j < this.list[this.priority[i]].length; j++) {
                // Выполняем обработчик
                    this.list[this.priority[i]][j]();
                }
            }
        }
        
    // Удаляем Onloader
        delete Onloader;
        
    // Очищаем onload
        window.onload = null;
    }}}
);

//--------------------------------------------------------------------------------------------------

// Добавляем обработчик в window.onload
    window.onload = function() {
        Onloader.onload();
    };

//--------------------------------------------------------------------------------------------------